# CHATS = [-1001340712809]
import os

BOT_TOKEN = os.environ['BOT_TOKEN']
API_HASH = os.environ['API_HASH']
API_ID = int(os.environ['API_ID'])

ADMINS = [364702722, 433120468, 450695029, 724477101]

TECHSUPPORT_CHAT_ID = '-1001217984190'

CHANNELS = [
    ["Одесса", "-1001398658451", ['Черноморск', 'Грибовка', 'Затока', 'Измаил', 'Каролино-Бугаз',
                                  'Коблево', 'Южный', 'Белгород-Днестровский']],
    ["Киев", "-1001238735651", ["Белая Церковь", "Борисполь", "Боярка", "Бровары", "Буча", "Вишневое", "Вышгород",
                                "Ирпень", "Украинка", "Фастов"]],
    ["Харьков", "-1001209540617", ["Лозовая", "Купянск", "Изюм"]],
    ["Днепр", "-1001224243674", ["Кривой Рог", "Каменское", "Никополь", "Павлоград", "Новомосковск"]],
    ["Львов", "-1001269187643", ["Борислав", "Дрогобыч", "Самбор", "Стрый", "Червоноград"]],
]

CHATS = list(map(lambda x: int(x[1]), CHANNELS))
#
# VACS = [
#     'Бармен',
#     'Официант'
# ]
#
